# Homework w06d02 - SQL joins

#### 1. Connect to the Northwind database

In [1]:
%load_ext sql

In [6]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT * FROM information_schema.tables WHERE table_schema = 'public';

#### 2. Use joins between the tables of employeeterritories, territories, regions,  orders, order_details and products to produce a table containing the columns EmployeeID, RegionDescription, TerritoryDescription, OrderID, ProductID and UnitPrice.

#### Hint: Create a copy of the region table and insert a new column into this copy which translates Eastern to east, Western to west, etc.

In [13]:
%%sql
SELECT * FROM orders limit 5;

5 rows affected.

[(10248, u'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, u'Vins et alcools Chevalier', u"59 rue de l'Abbaye", u'Reims', None, u'51100', u'France'),
 (10249, u'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, u'Toms Spezialit\xe4ten', u'Luisenstr. 48', u'M\xfcnster', None, u'44087', u'Germany'),
 (10250, u'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil'),
 (10251, u'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, u'Victuailles en stock', u'2, rue du Commerce', u'Lyon', None, u'69004', u'France'),
 (10252, u'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, u'Supr\xeames d\xe9lices', u'Boulevard Tirou, 255', u'Charleroi', None, u'B-6000', u'Belgium')]

In [4]:
%%sql
SELECT
order_details."ProductID", order_details."UnitPrice",
orders."OrderID", orders."EmployeeID",
territories."TerritoryDescription",
region."RegionDescription"
INTO fo
FROM order_details
INNER JOIN orders ON order_details."OrderID" = orders."OrderID"
INNER JOIN employeeterritories ON orders."EmployeeID" = employeeterritories."EmployeeID"
INNER JOIN territories ON employeeterritories."TerritoryID" = territories."TerritoryID"
INNER JOIN region ON territories."RegionID" = region."RegionID";

10129 rows affected.

[]

#### 3. What is the total price of units sold by the individual employees?

In [22]:
%%sql
select * from order_details limit 2;

2 rows affected.

[(10248, 11, 14.0, 12, 0.0), (10248, 42, 9.8, 10, 0.0)]

In [32]:
%%sql
select fo."EmployeeID",sum(fo."UnitPrice"*od."Quantity") as sum
from fo 
inner join order_details as od
on fo."OrderID" = od."OrderID"
group by 1 
order by sum desc
limit 10;

9 rows affected.

[(7, 4214504.79824066),
 (2, 3911401.34994268),
 (3, 2832575.75277901),
 (4, 2520974.58055687),
 (5, 1784495.16234064),
 (8, 1749816.68224525),
 (9, 1672019.08659458),
 (1, 1307027.02043915),
 (6, 1185223.34955215)]

#### 4. What is the total price of units sold per RegionDescription (Eastern, Western, etc.)?

In [33]:
%%sql
select fo."RegionDescription",sum(fo."UnitPrice"*od."Quantity") as sum
from fo 
inner join order_details as od
on fo."OrderID" = od."OrderID"
group by 1 
order by sum desc
limit 10;

4 rows affected.

[(u'Eastern', 9523898.11327934),
 (u'Western', 5399728.14779282),
 (u'Northern', 3421835.76883984),
 (u'Southern', 2832575.75277901)]

#### 5. What is the total price of units sold per TerritoryDescription (Boston, Denver, etc.)?

In [34]:
%%sql
select fo."TerritoryDescription",sum(fo."UnitPrice"*od."Quantity") as sum
from fo 
inner join order_details as od
on fo."OrderID" = od."OrderID"
group by 1 
order by sum desc
limit 10;

10 rows affected.

[(u'Greensboro', 840324.860185623),
 (u'Cary', 840324.860185623),
 (u'Rockville', 840324.860185623),
 (u'Tampa', 708143.938194752),
 (u'Savannah', 708143.938194752),
 (u'Orlando', 708143.938194752),
 (u'Atlanta', 708143.938194752),
 (u'Wilton', 653513.510219574),
 (u'Neward', 653513.510219574),
 (u'Cambridge', 558771.621420383)]